Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-MC_DFP/1.2.52/PIC32CM6408MC00032/atdf/PIC32CM6408MC00032.atdf
        <register name="INTENSET" offset="0x10" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="READY" caption="NVM Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="ERROR" caption="Error Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTFLAG" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="READY" caption="NVM Ready" mask="0x1" values="NVMCTRL_INTFLAG__READY"/>
          <bitfield name="ERROR" caption="Error" mask="0x2" values="NVMCTRL_INTFLAG__ERROR"/>
        </register>
        <register name="STATUS" offset="0x18" rw="RW" size="2" initval="0x0000" caption="Status">
          <bitfield name="PRM" caption="Power Reduction Mode" mask="0x1"/>
          <bitfield name="LOAD" caption="NVM Page Buffer Active Loading" mask="0x2"/>
          <bitfield name="PROGE" caption="Programming Error Status" mask="0x4"/>
          <bitfield name="LOCKE" caption="Lock Error Status" mask="0x8"/>
          <bitfield name="NVME" caption="NVM Error" mask="0x10"/>
          <bitfield name="SB" caption="Security Bit Status" mask="0x100"/>
        </register>
        <register name="ADDR" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="Address">
          <bitfield name="ADDR" caption="NVM Address" mask="0x3FFFFF"/>
        </register>
        <register name="LOCK" offset="0x20" rw="RW" size="2" initval="0x0000" caption="Lock Section">
          <bitfield name="LOCK" caption="Region Lock Bits" mask="0xFFFF"/>
        </register>
        <register name="PBLDATA0" offset="0x28" rw="R" size="4" initval="0xFFFFFFFF" caption="Page Buffer Load Data 0">
          <bitfield name="PBLDATA" caption="Page Buffer Load Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="PBLDATA1" offset="0x2C" rw="R" size="4" initval="0xFFFFFFFF" caption="Page Buffer Load Data 1">
          <bitfield name="PBLDATA" caption="Page Buffer Load Data" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="NVMCTRL_CTRLA__CMD">
        <value name="ER" caption="Erase Row - Erases the row addressed by the ADDR register." value="0x02"/>
        <value name="WP" caption="Write Page - Writes the contents of the page buffer to the page addressed by the ADDR register." value="0x04"/>
        <value name="EAR" caption="Erase Auxiliary Row - Erases the auxiliary row addressed by the ADDR register. This command can be given only when the security bit is not set and only to the user configuration row." value="0x05"/>
        <value name="WAP" caption="Write Auxiliary Page - Writes the contents of the page buffer to the page addressed by the ADDR register. This command can be given only when the security bit is not set and only to the user configuration row." value="0x06"/>
        <value name="SF" caption="Security Flow Command" value="0x0A"/>
        <value name="WL" caption="Write lockbits" value="0x0F"/>
        <value name="DFER" caption="Data Flash Erase Row - Erases the row addressed by the ADDR register." value="0x1A"/>
        <value name="DFWP" caption="Data Flash Write Page - Writes the contents of the page buffer to the page addressed by the ADDR register." value="0x1C"/>
        <value name="LR" caption="Lock Region - Locks the region containing the address location in the ADDR register." value="0x40"/>
        <value name="UR" caption="Unlock Region - Unlocks the region containing the address location in the ADDR register." value="0x41"/>
        <value name="SPRM" caption="Sets the power reduction mode." value="0x42"/>
        <value name="CPRM" caption="Clears the power reduction mode." value="0x43"/>
        <value name="PBC" caption="Page Buffer Clear - Clears the page buffer." value="0x44"/>
        <value name="SSB" caption="Set Security Bit - Sets the security bit by writing 0x00 to the first byte in the lockbit row." value="0x45"/>
        <value name="INVALL" caption="Invalidate all cache lines." value="0x46"/>
        <value name="SCEHL" caption="Set Chip Erase Hard Lock (SCEHL) flash controller command" value="0x7f"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLA__CMDEX">
        <value name="KEY" caption="Execution Key" value="0xA5"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLB__CACHEDIS">
        <value name="CACHE_DF_DIS_MAIN_EN" caption="The Data Flash cache is disabled, the main array cache is enabled" value="0x0"/>
        <value name="CACHE_DF_DIS_MAIN_DIS" caption="The Data Flash cache is disabled, the main array cache is disabled" value="0x1"/>
        <value name="CACHE_DF_EN_MAIN_EN" caption="The Data Flash cache is enabled, the main array cache is enabled" value="0x2"/>
        <value name="CACHE_DF_EN_MAIN_DIS" caption="The Data Flash cache is enabled, the main array cache is disabled" value="0x3"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLB__READMODE">
        <value name="NO_MISS_PENALTY" caption="The NVM Controller (cache system) does not insert wait states on a cache miss. Gives the best system performance." value="0x0"/>
        <value name="LOW_POWER" caption="Reduces power consumption of the cache system, but inserts a wait state each time there is a cache miss. This mode may not be relevant if CPU performance is required, as the application will be stalled and may lead to increase run time." value="0x1"/>
        <value name="DETERMINISTIC" caption="The cache system ensures that a cache hit or miss takes the same amount of time, determined by the number of programmed flash wait states. This mode can be used for real-time applications that require deterministic execution timings." value="0x2"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLB__RWS">
        <value name="SINGLE" caption="Single Auto Wait State" value="0"/>
        <value name="HALF" caption="Half Auto Wait State" value="1"/>
        <value name="DUAL" caption="Dual Auto Wait State" value="2"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLB__SLEEPPRM">
        <value name="WAKEONACCESS" caption="NVM block enters low-power mode when entering sleep.NVM block exits low-power mode upon first access." value="0"/>
        <value name="WAKEUPINSTANT" caption="NVM block enters low-power mode when entering sleep.NVM block exits low-power mode when exiting sleep." value="1"/>
        <value name="DISABLED" caption="Auto power reduction disabled." value="3"/>
      </value-group>
      <value-group name="NVMCTRL_PARAM__PSZ">
        <value name="8" caption="8 bytes" value="0x0"/>
        <value name="16" caption="16 bytes" value="0x1"/>
        <value name="32" caption="32 bytes" value="0x2"/>
        <value name="64" caption="64 bytes" value="0x3"/>
        <value name="128" caption="128 bytes" value="0x4"/>
        <value name="256" caption="256 bytes" value="0x5"/>
        <value name="512" caption="512 bytes" value="0x6"/>
        <value name="1024" caption="1024 bytes" value="0x7"/>
      </value-group>
      <value-group name="NVMCTRL_INTFLAG__ERROR">
        <value name="Val_0" caption="No errors have been received since the last clear" value="0x0"/>
        <value name="Val_1" caption="At least one error has occurred since the last clear" value="0x1"/>
      </value-group>
      <value-group name="NVMCTRL_INTFLAG__READY">
        <value name="Val_0" caption="The NVM controller is busy programming or erasing." value="0x0"/>
        <value name="Val_1" caption="The NVM controller is ready to accept a new command" value="0x1"/>
      </value-group>
    </module>
    <module name="FUSES" id="03929" version="1a0" caption="Non-Volatile Fuses">
      <register-group name="LOCKBIT_FUSES">
        <register name="LOCKBIT_WORD_0" offset="0x0" rw="R" size="4" caption="LOCKBIT Page Word 0">
          <bitfield name="NVMCTRL_CEHL" caption="CEHL Bits" mask="0x3F000000"/>
        </register>
      </register-group>
      <register-group name="OTP1_FUSES">
        <register name="OTP1_WORD_0" offset="0x0" rw="R" size="4" caption="OTP1 Page Word 0">
          <bitfield name="NVMCTRL_NVM_LOCK" caption="NVM Lock" mask="0xFF"/>
          <bitfield name="NVMCTRL_PSZ" caption="NVM Page Size" mask="0x300"/>
          <bitfield name="NVMCTRL_NVMP" caption="Number of NVM Pages" mask="0x3FFF0000"/>
        </register>
        <register name="OTP1_WORD_1" offset="0x4" rw="R" size="4" caption="OTP1 Page Word 1">
          <bitfield name="NVMCTRL_DATAFLASHP" caption="Number of Data Flash Pages" mask="0xFF"/>
        </register>
      </register-group>
