Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-MC_DFP/1.2.52/PIC32CM6408MC00032/atdf/PIC32CM6408MC00032.atdf
        <register name="OSC32K" offset="0x18" rw="RW" size="4" initval="0x003F0080" caption="32kHz Internal Oscillator (OSC32K) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="EN32K" caption="32kHz Output Enable" mask="0x4"/>
          <bitfield name="EN1K" caption="1kHz Output Enable" mask="0x8"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="STARTUP" caption="Oscillator Start-Up Time" mask="0x700" values="OSC32KCTRL_OSC32K__STARTUP"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x1000"/>
          <bitfield name="CALIB" caption="Oscillator Calibration" mask="0x7F0000"/>
        </register>
        <register name="OSCULP32K" offset="0x1C" rw="RW" size="4" caption="32kHz Ultra Low Power Internal Oscillator (OSCULP32K) Control">
          <bitfield name="EN32K" caption="Enable Out 32k" mask="0x2"/>
          <bitfield name="EN1K" caption="Enable Out 1k" mask="0x4"/>
          <bitfield name="CALIB" caption="Oscillator Calibration" mask="0x1F00"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x8000"/>
        </register>
      </register-group>
      <value-group name="OSC32KCTRL_RTCCTRL__RTCSEL">
        <value name="ULP1K" caption="1.024kHz from 32kHz internal ULP oscillator" value="0"/>
        <value name="ULP32K" caption="32.768kHz from 32kHz internal ULP oscillator" value="1"/>
        <value name="OSC1K" caption="1.024kHz from 32.768kHz internal oscillator" value="2"/>
        <value name="OSC32K" caption="32.768kHz from 32.768kHz internal oscillator" value="3"/>
        <value name="XOSC1K" caption="1.024kHz from 32.768kHz external crystal oscillator" value="4"/>
        <value name="XOSC32K" caption="32.768kHz from 32.768kHz external crystal oscillator" value="5"/>
      </value-group>
      <value-group name="OSC32KCTRL_XOSC32K__STARTUP">
        <value name="CYCLE1" caption="122 us" value="0"/>
        <value name="CYCLE32" caption="1.06 ms" value="1"/>
        <value name="CYCLE2048" caption="62.6 ms" value="2"/>
        <value name="CYCLE4096" caption="125 ms" value="3"/>
        <value name="CYCLE16384" caption="500 ms" value="4"/>
        <value name="CYCLE32768" caption="1 s" value="5"/>
        <value name="CYCLE65536" caption="2 s" value="6"/>
        <value name="CYCLE131072" caption="4 s" value="7"/>
      </value-group>
      <value-group name="OSC32KCTRL_OSC32K__STARTUP">
        <value name="CYCLE3" caption="0.183 ms" value="0"/>
        <value name="CYCLE4" caption="0.214 ms" value="1"/>
        <value name="CYCLE6" caption="0.275 ms" value="2"/>
        <value name="CYCLE10" caption="0.397 ms" value="3"/>
        <value name="CYCLE18" caption="0.641 ms" value="4"/>
        <value name="CYCLE34" caption="1.129 ms" value="5"/>
        <value name="CYCLE66" caption="2.106 ms" value="6"/>
        <value name="CYCLE130" caption="4.059 ms" value="7"/>
      </value-group>
    </module>
    <module name="PAC" id="U2120" version="1.1.0" caption="Peripheral Access Controller">
      <register-group name="PAC" caption="Peripheral Access Controller">
        <register name="WRCTRL" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Write control">
          <bitfield name="PERID" caption="Peripheral identifier" mask="0xFFFF"/>
          <bitfield name="KEY" caption="Peripheral access control key" mask="0xFF0000" values="PAC_WRCTRL__KEY"/>
        </register>
        <register name="EVCTRL" offset="0x4" rw="RW" size="1" initval="0x00" caption="Event control">
          <bitfield name="ERREO" caption="Peripheral acess error event output" mask="0x1"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt enable clear">
          <bitfield name="ERR" caption="Peripheral access error interrupt disable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt enable set">
          <bitfield name="ERR" caption="Peripheral access error interrupt enable" mask="0x1"/>
        </register>
        <register name="INTFLAGAHB" offset="0x10" rw="RW" size="4" atomic-op="clear:INTFLAGAHB" initval="0x00000000" caption="Bridge interrupt flag status">
          <bitfield name="FLASH_" caption="FLASH" mask="0x1"/>
          <bitfield name="HSRAMCM0P_" caption="SRAM CPU" mask="0x2"/>
          <bitfield name="HSRAMDSU_" caption="SRAM DSU" mask="0x4"/>
          <bitfield name="APBB_" caption="HPB1" mask="0x8"/>
          <bitfield name="APBA_" caption="HPB0" mask="0x10"/>
          <bitfield name="APBC_" caption="HPB2" mask="0x20"/>
          <bitfield name="LPRAMDMAC_" caption="SRAM DMAC" mask="0x40"/>
          <bitfield name="DIVAS_" caption="DIVAS" mask="0x80"/>
        </register>
        <register name="INTFLAGA" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAGA" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge A">
          <bitfield name="PAC_" caption="PAC" mask="0x1"/>
          <bitfield name="PM_" caption="PM" mask="0x2"/>
          <bitfield name="MCLK_" caption="MCLK" mask="0x4"/>
          <bitfield name="RSTC_" caption="RSTC" mask="0x8"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL" mask="0x10"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL" mask="0x20"/>
          <bitfield name="SUPC_" caption="SUPC" mask="0x40"/>
          <bitfield name="GCLK_" caption="GCLK" mask="0x80"/>
          <bitfield name="WDT_" caption="WDT" mask="0x100"/>
          <bitfield name="RTC_" caption="RTC" mask="0x200"/>
          <bitfield name="EIC_" caption="EIC" mask="0x400"/>
          <bitfield name="FREQM_" caption="FREQM" mask="0x800"/>
          <bitfield name="TSENS_" caption="TSENS" mask="0x1000"/>
        </register>
        <register name="INTFLAGB" offset="0x18" rw="RW" size="4" atomic-op="clear:INTFLAGB" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge B">
          <bitfield name="PORT_" caption="PORT" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL" mask="0x4"/>
          <bitfield name="DMAC_" caption="DMAC" mask="0x8"/>
          <bitfield name="MTB_" caption="MTB" mask="0x10"/>
          <bitfield name="HMATRIXHS_" caption="HMATRIXHS" mask="0x20"/>
        </register>
        <register name="INTFLAGC" offset="0x1C" rw="RW" size="4" atomic-op="clear:INTFLAGC" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge C">
          <bitfield name="EVSYS_" caption="EVSYS" mask="0x1"/>
          <bitfield name="SERCOM0_" caption="SERCOM0" mask="0x2"/>
          <bitfield name="SERCOM1_" caption="SERCOM1" mask="0x4"/>
          <bitfield name="SERCOM2_" caption="SERCOM2" mask="0x8"/>
          <bitfield name="SERCOM3_" caption="SERCOM3" mask="0x10"/>
          <bitfield name="TCC0_" caption="TCC0" mask="0x200"/>
          <bitfield name="TCC1_" caption="TCC1" mask="0x400"/>
          <bitfield name="TCC2_" caption="TCC2" mask="0x800"/>
          <bitfield name="TC0_" caption="TC0" mask="0x1000"/>
          <bitfield name="TC1_" caption="TC1" mask="0x2000"/>
          <bitfield name="TC2_" caption="TC2" mask="0x4000"/>
          <bitfield name="TC3_" caption="TC3" mask="0x8000"/>
          <bitfield name="TC4_" caption="TC4" mask="0x10000"/>
          <bitfield name="ADC0_" caption="ADC0" mask="0x20000"/>
          <bitfield name="ADC1_" caption="ADC1" mask="0x40000"/>
          <bitfield name="SDADC_" caption="SDADC" mask="0x80000"/>
          <bitfield name="AC_" caption="AC" mask="0x100000"/>
          <bitfield name="DAC_" caption="DAC" mask="0x200000"/>
          <bitfield name="CCL_" caption="CCL" mask="0x800000"/>
          <bitfield name="PDEC_" caption="PDEC" mask="0x4000000"/>
        </register>
        <register name="STATUSA" offset="0x34" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge A">
          <bitfield name="PAC_" caption="PAC APB Protect Enable" mask="0x1"/>
          <bitfield name="PM_" caption="PM APB Protect Enable" mask="0x2"/>
          <bitfield name="MCLK_" caption="MCLK APB Protect Enable" mask="0x4"/>
          <bitfield name="RSTC_" caption="RSTC APB Protect Enable" mask="0x8"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL APB Protect Enable" mask="0x10"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL APB Protect Enable" mask="0x20"/>
          <bitfield name="SUPC_" caption="SUPC APB Protect Enable" mask="0x40"/>
          <bitfield name="GCLK_" caption="GCLK APB Protect Enable" mask="0x80"/>
          <bitfield name="WDT_" caption="WDT APB Protect Enable" mask="0x100"/>
          <bitfield name="RTC_" caption="RTC APB Protect Enable" mask="0x200"/>
          <bitfield name="EIC_" caption="EIC APB Protect Enable" mask="0x400"/>
          <bitfield name="FREQM_" caption="FREQM APB Protect Enable" mask="0x800"/>
          <bitfield name="TSENS_" caption="TSENS APB Protect Enable" mask="0x1000"/>
        </register>
