Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-MC_DFP/1.2.52/PIC32CM6408MC00032/atdf/PIC32CM6408MC00032.atdf
      <value-group name="PDEC_CTRLA__MODE">
        <value name="QDEC" caption="QDEC operating mode" value="0"/>
        <value name="HALL" caption="HALL operating mode" value="1"/>
        <value name="COUNTER" caption="COUNTER operating mode" value="2"/>
      </value-group>
      <value-group name="PDEC_CTRLBCLR__CMD">
        <value name="NONE" caption="No action" value="0"/>
        <value name="RETRIGGER" caption="Force a counter restart or retrigger" value="1"/>
        <value name="UPDATE" caption="Force update of double buffered registers" value="2"/>
        <value name="READSYNC" caption="Force a read synchronization of COUNT" value="3"/>
        <value name="START" caption="Start QDEC/HALL" value="4"/>
        <value name="STOP" caption="Stop QDEC/HALL" value="5"/>
      </value-group>
      <value-group name="PDEC_CTRLBSET__CMD">
        <value name="NONE" caption="No action" value="0"/>
        <value name="RETRIGGER" caption="Force a counter restart or retrigger" value="1"/>
        <value name="UPDATE" caption="Force update of double buffered registers" value="2"/>
        <value name="READSYNC" caption="Force a read synchronization of COUNT" value="3"/>
        <value name="START" caption="Start QDEC/HALL" value="4"/>
        <value name="STOP" caption="Stop QDEC/HALL" value="5"/>
      </value-group>
      <value-group name="PDEC_EVCTRL__EVACT">
        <value name="OFF" caption="Event action disabled" value="0"/>
        <value name="RETRIGGER" caption="Start, restart or retrigger on event" value="1"/>
        <value name="COUNT" caption="Count on event" value="2"/>
      </value-group>
      <value-group name="PDEC_PRESC__PRESC">
        <value name="DIV1" caption="No division" value="0"/>
        <value name="DIV2" caption="Divide by 2" value="1"/>
        <value name="DIV4" caption="Divide by 4" value="2"/>
        <value name="DIV8" caption="Divide by 8" value="3"/>
        <value name="DIV16" caption="Divide by 16" value="4"/>
        <value name="DIV32" caption="Divide by 32" value="5"/>
        <value name="DIV64" caption="Divide by 64" value="6"/>
        <value name="DIV128" caption="Divide by 128" value="7"/>
        <value name="DIV256" caption="Divide by 256" value="8"/>
        <value name="DIV512" caption="Divide by 512" value="9"/>
        <value name="DIV1024" caption="Divide by 1024" value="10"/>
      </value-group>
      <value-group name="PDEC_PRESCBUF__PRESCBUF">
        <value name="DIV1" caption="No division" value="0"/>
        <value name="DIV2" caption="Divide by 2" value="1"/>
        <value name="DIV4" caption="Divide by 4" value="2"/>
        <value name="DIV8" caption="Divide by 8" value="3"/>
        <value name="DIV16" caption="Divide by 16" value="4"/>
        <value name="DIV32" caption="Divide by 32" value="5"/>
        <value name="DIV64" caption="Divide by 64" value="6"/>
        <value name="DIV128" caption="Divide by 128" value="7"/>
        <value name="DIV256" caption="Divide by 256" value="8"/>
        <value name="DIV512" caption="Divide by 512" value="9"/>
        <value name="DIV1024" caption="Divide by 1024" value="10"/>
      </value-group>
    </module>
    <module name="PM" id="U2240" version="2.1.0" caption="Power Manager">
      <register-group name="PM" caption="Power Manager">
        <register name="SLEEPCFG" offset="0x1" rw="RW" size="1" initval="0x00" caption="Sleep Configuration">
          <bitfield name="SLEEPMODE" caption="Sleep Mode" mask="0x7" values="PM_SLEEPCFG__SLEEPMODE"/>
        </register>
        <register name="STDBYCFG" offset="0x8" rw="RW" size="2" initval="0x0400" caption="Standby Configuration">
          <bitfield name="VREGSMOD" caption="Voltage Regulator Standby mode" mask="0xC0" values="PM_STDBYCFG__VREGSMOD"/>
          <bitfield name="BBIASHS" caption="Back Bias for SRAM" mask="0x400"/>
        </register>
      </register-group>
      <value-group name="PM_SLEEPCFG__SLEEPMODE">
        <value name="IDLE" caption="CPU clock is OFF. AHB/APB clocks are provided to IPs requesting them" value="2"/>
        <value name="STANDBY" caption="CPU clock is OFF. AHB/APB clocks are stopped except if requested" value="4"/>
      </value-group>
      <value-group name="PM_STDBYCFG__VREGSMOD">
        <value name="AUTO" caption="Automatic mode" value="0"/>
        <value name="PERFORMANCE" caption="Performance oriented" value="1"/>
        <value name="LP" caption="Low Power oriented" value="2"/>
      </value-group>
    </module>
    <module name="PORT" id="U2210" version="2.1.1" caption="Port Module">
      <register-group name="GROUP" size="0x80">
        <register name="DIR" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Data Direction">
          <bitfield name="DIR" caption="Port Data Direction" mask="0xFFFFFFFF"/>
        </register>
        <register name="DIRCLR" offset="0x4" rw="RW" size="4" atomic-op="clear:DIR" initval="0x00000000" caption="Data Direction Clear">
          <bitfield name="DIRCLR" caption="Port Data Direction Clear" mask="0xFFFFFFFF"/>
        </register>
        <register name="DIRSET" offset="0x8" rw="RW" size="4" atomic-op="set:DIR" initval="0x00000000" caption="Data Direction Set">
          <bitfield name="DIRSET" caption="Port Data Direction Set" mask="0xFFFFFFFF"/>
        </register>
        <register name="DIRTGL" offset="0xC" rw="RW" size="4" atomic-op="toggle:DIR" initval="0x00000000" caption="Data Direction Toggle">
          <bitfield name="DIRTGL" caption="Port Data Direction Toggle" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUT" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Data Output Value">
          <bitfield name="OUT" caption="PORT Data Output Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTCLR" offset="0x14" rw="RW" size="4" atomic-op="clear:OUT" initval="0x00000000" caption="Data Output Value Clear">
          <bitfield name="OUTCLR" caption="PORT Data Output Value Clear" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTSET" offset="0x18" rw="RW" size="4" atomic-op="set:OUT" initval="0x00000000" caption="Data Output Value Set">
          <bitfield name="OUTSET" caption="PORT Data Output Value Set" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTTGL" offset="0x1C" rw="RW" size="4" atomic-op="toggle:OUT" initval="0x00000000" caption="Data Output Value Toggle">
          <bitfield name="OUTTGL" caption="PORT Data Output Value Toggle" mask="0xFFFFFFFF"/>
        </register>
        <register name="IN" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Data Input Value">
          <bitfield name="IN" caption="PORT Data Input Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="CTRL" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Control">
          <bitfield name="SAMPLING" caption="Input Sampling Mode" mask="0xFFFFFFFF"/>
        </register>
