Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-MC_DFP/1.2.52/PIC32CM6408MC00032/atdf/PIC32CM6408MC00032.atdf
      <value-group name="WDT_EWCTRL__EWOFFSET">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="WDT_CLEAR__CLEAR">
        <value name="KEY" caption="Clear Key" value="0xA5"/>
      </value-group>
    </module>
    <module name="MPU" version="1.0.0" caption="Memory Protection Unit">
      <register-group name="MPU" caption="Memory Protection Unit">
        <register name="TYPE" offset="0x0" rw="R" size="4" access-size="4" caption="MPU Type Register">
          <bitfield name="SEPARATE" caption="Separate instruction and Data Memory MapsRegions" mask="0x1"/>
          <bitfield name="DREGION" caption="Number of Data Regions" mask="0xFF00"/>
          <bitfield name="IREGION" caption="Number of Instruction Regions" mask="0xFF0000"/>
        </register>
        <register name="CTRL" offset="0x4" rw="RW" size="4" access-size="4" caption="MPU Control Register">
          <bitfield name="ENABLE" caption="MPU Enable" mask="0x1"/>
          <bitfield name="HFNMIENA" caption="Enable Hard Fault and NMI handlers" mask="0x2"/>
          <bitfield name="PRIVDEFENA" caption="Enables privileged software access to default memory map" mask="0x4"/>
        </register>
        <register name="RNR" offset="0x8" rw="RW" size="4" access-size="4" caption="MPU Region Number Register">
          <bitfield name="REGION" caption="Region referenced by RBAR and RASR" mask="0xFF"/>
        </register>
        <register name="RBAR" offset="0xC" rw="RW" size="4" access-size="4" caption="MPU Region Base Address Register">
          <bitfield name="REGION" caption="Region number" mask="0xF"/>
          <bitfield name="VALID" caption="Region number valid" mask="0x10"/>
          <bitfield name="ADDR" caption="Region base address" mask="0xFFFFFFE0"/>
        </register>
        <register name="RASR" offset="0x10" rw="RW" size="4" access-size="4" caption="MPU Region Attribute and Size Register">
          <bitfield name="ENABLE" caption="Region Enable" mask="0x1"/>
          <bitfield name="SIZE" caption="Region Size" mask="0x3E"/>
          <bitfield name="SRD" caption="Sub-region disable" mask="0xFF00"/>
          <bitfield name="B" caption="Bufferable bit" mask="0x10000"/>
          <bitfield name="C" caption="Cacheable bit" mask="0x20000"/>
          <bitfield name="S" caption="Shareable bit" mask="0x40000"/>
          <bitfield name="TEX" caption="TEX bit" mask="0x380000"/>
          <bitfield name="AP" caption="Access Permission" mask="0x7000000"/>
          <bitfield name="XN" caption="Execute Never Attribute" mask="0x10000000"/>
        </register>
      </register-group>
    </module>
    <module name="NVIC" version="1.0.0" caption="Nested Vectored Interrupt Controller">
      <register-group name="NVIC" caption="Nested Vectored Interrupt Controller">
        <register name="ISER" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Interrupt Set Enable Register">
          <bitfield name="SETENA" caption="Interrupt set enable bits" mask="0x7FFFFFFF"/>
        </register>
        <register name="ICER" offset="0x80" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Interrupt Clear Enable Register">
          <bitfield name="CLRENA" caption="Interrupt clear-enable bits" mask="0x7FFFFFFF"/>
        </register>
        <register name="ISPR" offset="0x100" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Interrupt Set Pending Register">
          <bitfield name="SETPEND" caption="Interrupt set-pending bits" mask="0x7FFFFFFF"/>
        </register>
        <register name="ICPR" offset="0x180" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Interrupt Clear Pending Register">
          <bitfield name="CLRPEND" caption="Interrupt clear-pending bits" mask="0x7FFFFFFF"/>
        </register>
        <register name="IPR" offset="0x300" rw="RW" size="4" access-size="4" count="8" initval="0x00000000" caption="Interrupt Priority Register n">
          <bitfield name="PRI0" caption="Priority of interrupt n" mask="0x3"/>
          <bitfield name="PRI1" caption="Priority of interrupt n" mask="0x300"/>
          <bitfield name="PRI2" caption="Priority of interrupt n" mask="0x30000"/>
          <bitfield name="PRI3" caption="Priority of interrupt n" mask="0x3000000"/>
        </register>
      </register-group>
    </module>
    <module name="SysTick" version="1.0.0" caption="System timer">
      <register-group name="SysTick" caption="System timer">
        <register name="CSR" offset="0x0" rw="RW" size="4" access-size="4" initval="0x4" caption="SysTick Control and Status Register">
          <bitfield name="ENABLE" caption="SysTick Counter Enable" mask="0x1" values="SysTick_CSR__ENABLE"/>
          <bitfield name="TICKINT" caption="SysTick Exception Request Enable" mask="0x2" values="SysTick_CSR__TICKINT"/>
          <bitfield name="CLKSOURCE" caption="Clock Source 0=external, 1=processor" mask="0x4" values="SysTick_CSR__CLKSOURCE"/>
          <bitfield name="COUNTFLAG" caption="Timer counted to 0 since last read of register" mask="0x10000"/>
        </register>
        <register name="RVR" offset="0x4" rw="RW" size="4" access-size="4" caption="SysTick Reload Value Register">
          <bitfield name="RELOAD" caption="Value to load into the SysTick Current Value Register when the counter reaches 0" mask="0xFFFFFF"/>
        </register>
        <register name="CVR" offset="0x8" rw="RW" size="4" access-size="4" caption="SysTick Current Value Register">
          <bitfield name="CURRENT" caption="Current value at the time the register is accessed" mask="0xFFFFFF"/>
        </register>
        <register name="CALIB" offset="0xC" rw="R" size="4" access-size="4" initval="0" caption="SysTick Calibration Value Register">
          <bitfield name="TENMS" caption="Reload value to use for 10ms timing" mask="0xFFFFFF"/>
          <bitfield name="SKEW" caption="TENMS is rounded from non-integer ratio" mask="0x40000000" values="SysTick_CALIB__SKEW"/>
          <bitfield name="NOREF" caption="No Separate Reference Clock" mask="0x80000000" values="SysTick_CALIB__NOREF"/>
        </register>
      </register-group>
      <value-group name="SysTick_CSR__CLKSOURCE">
        <value name="VALUE_0" caption="External clock" value="0"/>
        <value name="VALUE_1" caption="Processor clock" value="1"/>
      </value-group>
